A1 = set(["a", "b", "c", "d", "e", "f", "g"])  # множество активностей 7
L1 = [['a', 'b', 'c', 'd', 'e', 'f'], ['a', 'b', 'c', 'd', 'e', 'g'],
     ['a', 'b', 'c', 'd', 'f', 'e'], ['a', 'b', 'c', 'd', 'f', 'g'],
     ['a', 'b', 'd', 'g'],
     ['a', 'b', 'd', 'e', 'f'], ['a', 'b', 'd', 'e', 'g'], ]  # журнал событий: 7 трасс, 41 событие, 7 активностей


A2 = set(['a', 'b', 'c', 'd']) # множество активностей 4
L2 = [['a', 'b', 'c'], ['a', 'b', 'd'],
      ['b', 'c', 'd'], ['b', 'd', 'c']] # журнал событий: 4 трассы, 12 событий, 4 активности


